emacs/.emacs.d/Haoyang.org
* README

Haoyang's GNU Emacs configuration, the n-th iteration.

Ideas are from [[http://eschulte.me/emacs24-starter-kit/#installation][Emacs Starter Kit]], [[http://pages.sachachua.com/.emacs.d/Sacha.html][Sache Chua's config]], [[https://sam217pa.github.io/2016/09/02/how-to-build-your-own-spacemacs/][Sam217's blog]] and my desire to use Org-mode as an effective project management tool.

** Principles

- Effective navigation (hence Evil-mode)
- Easy to read and edit (hence use-package, visual-line-mode)
- Simlified shortcuts
- Self documenting (hence which-key)
  
* Basic information

#+BEGIN_SRC emacs-lisp
(setq user-full-name "Haoyang Xu")
(setq user-mail-address "github@expoundite.net")
#+END_SRC

* Dependencies

This config requires Org-mode newer than 8.0, and Emacs > 23.

#+BEGIN_SRC emacs-lisp
  (when (version<= emacs-version "24")
  (message "This config requires at least Emacs 24, please upgrade."))

#+END_SRC

This config utilizes Emacs' package support. Some additional repositories are added.

#+BEGIN_SRC emacs-lisp
  (setq package-archives '(("gnu" . "https://elpa.gnu.org/packages/")
                           ("melpa" . "https://melpa.org/packages/")
                           ("marmalade" . "https://marmalade-repo.org/packages/")
                           ("org" . "http://orgmode.org/elpa/")))
#+END_SRC

Bootstrap =use-package=.

#+BEGIN_SRC emacs-lisp
  (unless (package-installed-p 'use-package) ; unless it is already installed
    (package-refresh-contents) ; updage packages archive
    (package-install 'use-package)) ; and install the most recent version of use-package

  (require 'use-package)
#+END_SRC

* Behaviour

A few sensible choices that affect the global behaviour of Emacs:

#+BEGIN_SRC emacs-lisp
  (setq delete-old-versions -1 ); delete excess backup versions silently
  (setq version-control t ); use version control
  (setq vc-make-backup-files t ); make backups file even when in version controlled dir
  (setq backup-directory-alist `(("." . "~/.emacs.d/backups")) ) ; which directory to put backups file
  (setq vc-follow-symlinks t )       ; don't ask for confirmation when opening symlinked file
  (setq auto-save-file-name-transforms '((".*" "~/.emacs.d/auto-save-list/" t)) ) ;transform backups file name
  (setq inhibit-startup-screen t ); inhibit useless and old-school startup screen
  (setq ring-bell-function 'ignore ); silent bell when you make a mistake
  (setq coding-system-for-read 'utf-8 ); use utf-8 by default
  (setq coding-system-for-write 'utf-8 )
  (setq sentence-end-double-space nil); sentence SHOULD end with only a point.
  (setq default-fill-column 80); toggle wrapping text at the 80th character
  (setq initial-scratch-message "Welcome in Emacs") ; print a default message in the empty scratch buffer opened at startup
  (tool-bar-mode -1)
  (menu-bar-mode -1)
  (scroll-bar-mode 0)
  (auto-fill-mode) ; toggle auto-fill-mode
  (diminish auto-fill-function "F") ; diminish the hint to a simple "F"
  (setq inhibit-startup-screen 1)
  (setq org-hide-emphasis-markers t)
  (setq package-check-singature nil)
  (setf epa-pinentry-mode 'loopback)
#+END_SRC
** Evil-mode
   Evil-mode allows vim-style modes and keybindings in Emacs. Now you have the best editor in the best Lisp Machine.

   #+BEGIN_SRC emacs-lisp
     (use-package evil :ensure t
                  :config
                  (evil-mode 1)
                  (evil-set-initial-state 'eww-mode 'emacs)
                  (evil-set-initial-state 'elfeed-search-mode 'emacs)
                  (evil-set-initial-state 'elfeed-show-mode 'emacs)
                  (evil-set-initial-state 'deft-mode 'emacs)
                  :diminish undo-tree-mode)
   #+END_SRC
  
** Swiper and friends

   #+BEGIN_SRC emacs-lisp
     (use-package swiper :ensure t
       :config
       (ivy-mode 1)
       (setq ivy-use-virtual-buffers t)
       (setq ivy-count-format "(%d/%d) ")
       :diminish ivy-mode
     )
     (use-package counsel :ensure t)
   #+END_SRC

** Version control

   #+BEGIN_SRC emacs-lisp
     (use-package magit :ensure t
       :diminish auto-revert-mode)
   #+END_SRC
** Projectile
   #+BEGIN_SRC emacs-lisp
     (use-package projectile :ensure t
       :config (projectile-global-mode)
       :diminish projectile-mode "P")

     (use-package counsel-projectile :ensure t
       :config (counsel-projectile-on))
   #+END_SRC
** Smartparens and rainbow delimiters

   Smartparens is an extension for more effective programming with less cause by
   missing/unmatched parentheses. Rainbow delimeters is for better looking interface.
  
   #+BEGIN_SRC emacs-lisp
     (use-package smartparens :ensure t
       :config
       (smartparens-global-mode t)
       (require 'smartparens-config)
       :diminish smartparens-mode)

     (use-package rainbow-delimiters :ensure t
       :config
       (add-to-list 'prog-mode-hook #'rainbow-delimiters-mode))
   #+END_SRC
** Flycheck
   #+BEGIN_SRC emacs-lisp
     (use-package flycheck :ensure t
       ;; intero installs flycheck as a dep, but still
       :init (global-flycheck-mode))
   #+END_SRC
** general.el and keybindings

   #+BEGIN_SRC emacs-lisp
     (use-package general :ensure t
      :config
       (general-define-key
        :states '(normal visual insert emacs)
        :prefix "SPC"
        :non-normal-prefix "S-SPC"

        ;; simple commands
        "/" 'counsel-ag
        "x" 'counsel-M-x
        "U" 'counsel-unicode-char
        "#" 'ansi-term

        ;; applications
        "a" '(:ignore t :which-key "Applications")
        "ad" 'dired
        "ae" 'elfeed

        ;; buffer operations
        "b" '(:ignore t :which-key "Buffer commands")
        "bb" 'ivy-switch-buffer
        "bl" 'ibuffer
        "bd" 'evil-delete-buffer
        "bp" 'evil-prev-buffer
        "bn" 'evil-next-buffer

        ;; deft operations
        "d" '(:ignore t :which-key "Deft")
        "dd" 'deft
        "df" 'deft-find-file

        ;; file and dir commands
        "f"  '(:ignore t :which-key "File commands")
        "ff" 'counsel-find-file
        "fa" 'find-file-at-point
        "fp" 'counsel-projectile
        "fs" 'save-buffer
        "fr" 'counsel-recentf

        ;; git operations
        "g" '(:ignore t :which-key "Git commands")
        "gs" 'magit-status
        "gd" 'magit-diff
        "gl" 'magit-log

        ;; help and docs
        "h" '(:ignore t :which-key "Help and documentation")
        "hf" 'counsel-describe-function
        "hv" 'counsel-describe-variable
        "hw" 'woman
        "hi" 'counsel-info-lookup-symbol

        ;; org-mode
        "o" '(:ignore t :which-key "Org-mode")
        "oa" 'org-agenda
        "oc" 'org-capture
        "oe" 'org-edit-special
        "ol" 'org-store-link
        "oL" 'org-insert-link
        "oo" 'counsel-outline
        "op" 'owp/do-publication
        "ot" 'counsel-org-tag

        ;; window operations
        "w" '(:ignore t :which-key "Windows")
        "ww" 'ace-window
        "wo" 'delete-other-windows
        "wv" 'evil-window-vsplit
        "ws" 'evil-window-split
        "wj" 'evil-window-down
        "wk" 'evil-window-up
        "wl" 'evil-window-right
        "wh" 'evil-window-left)
       (general-define-key "C-s" 'swiper)
       (general-define-key :keymaps 'org-mode-map :states '(insert normal emacs) "TAB" 'org-cycle))
     (use-package which-key :ensure t
       :config
       (which-key-mode 1)
       :diminish which-key-mode)
   #+END_SRC
** Completion
   At this point in time, it seems you should go for company-mode rather than auto-complete.

   #+BEGIN_SRC emacs-lisp
     (use-package company :ensure t
       :config
       (add-hook 'after-init-hook 'global-company-mode)
       (setq company-backend-list '(company-robe
                                  company-web
                                  company-jedi))
       :diminish company-mode)
   #+END_SRC

** Yasnippet
   #+BEGIN_SRC emacs-lisp
     (use-package yasnippet :ensure t
       :config
       (yas-global-mode t))
   #+END_SRC
** Proxies
   It is the sad reality in China that to access many useful resources on the
   Internet, you have to use a proxy. 

   #+BEGIN_SRC emacs-lisp :tangle no
     ;(setq url-proxy-services '(("no_proxy" . "^\\(localhost|192.168.*\\)")
     ;                           ("http"     . "127.0.0.1:8118")
     ;                           ("https"    . "127.0.0.1:8118")))
     ;(setenv "http_proxy" "socks5h://127.0.0.1:1080") ; elfeed uses curl, this makes curl called from emacs use proxy

   #+END_SRC
   
   Update: Not using elfeed now, so proxies are not really needed.

* Look
