emacs/.emacs.d/Haoyang.el
(setq user-full-name "Haoyang Xu")
(setq user-mail-address "github@expoundite.net")

(when (version<= emacs-version "24")
(message "This config requires at least Emacs 24, please upgrade."))

(setq package-archives '(("gnu" . "https://elpa.gnu.org/packages/")
                         ("melpa" . "https://melpa.org/packages/")
                         ("marmalade" . "https://marmalade-repo.org/packages/")
                         ("org" . "http://orgmode.org/elpa/")))

(unless (package-installed-p 'use-package) ; unless it is already installed
  (package-refresh-contents) ; updage packages archive
  (package-install 'use-package)) ; and install the most recent version of use-package

(require 'use-package)

(setq delete-old-versions -1 ); delete excess backup versions silently
(setq version-control t ); use version control
(setq vc-make-backup-files t ); make backups file even when in version controlled dir
(setq backup-directory-alist `(("." . "~/.emacs.d/backups")) ) ; which directory to put backups file
(setq vc-follow-symlinks t )       ; don't ask for confirmation when opening symlinked file
(setq auto-save-file-name-transforms '((".*" "~/.emacs.d/auto-save-list/" t)) ) ;transform backups file name
(setq inhibit-startup-screen t ); inhibit useless and old-school startup screen
(setq ring-bell-function 'ignore ); silent bell when you make a mistake
(setq coding-system-for-read 'utf-8 ); use utf-8 by default
(setq coding-system-for-write 'utf-8 )
(setq sentence-end-double-space nil); sentence SHOULD end with only a point.
(setq default-fill-column 80); toggle wrapping text at the 80th character
(setq initial-scratch-message "Welcome in Emacs") ; print a default message in the empty scratch buffer opened at startup
(tool-bar-mode -1)
(menu-bar-mode -1)
(scroll-bar-mode 0)
(auto-fill-mode) ; toggle auto-fill-mode
(diminish auto-fill-function "F") ; diminish the hint to a simple "F"
(setq inhibit-startup-screen 1)
(setq org-hide-emphasis-markers t)
(setq package-check-singature nil)
(setf epa-pinentry-mode 'loopback)

(use-package evil :ensure t
             :config
             (evil-mode 1)
             (evil-set-initial-state 'eww-mode 'emacs)
             (evil-set-initial-state 'elfeed-search-mode 'emacs)
             (evil-set-initial-state 'elfeed-show-mode 'emacs)
             (evil-set-initial-state 'deft-mode 'emacs)
             :diminish undo-tree-mode)

(use-package swiper :ensure t
  :config
  (ivy-mode 1)
  (setq ivy-use-virtual-buffers t)
  (setq ivy-count-format "(%d/%d) ")
  :diminish ivy-mode
)
(use-package counsel :ensure t)

(use-package magit :ensure t
  :diminish auto-revert-mode)

(use-package projectile :ensure t
  :config (projectile-global-mode)
  :diminish projectile-mode "P")

(use-package counsel-projectile :ensure t
  :config (counsel-projectile-on))

(use-package smartparens :ensure t
  :config
  (smartparens-global-mode t)
  (require 'smartparens-config)
  :diminish smartparens-mode)

(use-package rainbow-delimiters :ensure t
  :config
  (add-to-list 'prog-mode-hook #'rainbow-delimiters-mode))

(use-package flycheck :ensure t
  ;; intero installs flycheck as a dep, but still
  :init (global-flycheck-mode))

(use-package general :ensure t
 :config
  (general-define-key
   :states '(normal visual insert emacs)
   :prefix "SPC"
   :non-normal-prefix "S-SPC"

   ;; simple commands
   "/" 'counsel-ag
   "x" 'counsel-M-x
   "U" 'counsel-unicode-char
   "#" 'ansi-term

   ;; applications
   "a" '(:ignore t :which-key "Applications")
   "ad" 'dired
   "ae" 'elfeed

   ;; buffer operations
   "b" '(:ignore t :which-key "Buffer commands")
   "bb" 'ivy-switch-buffer
   "bl" 'ibuffer
   "bd" 'evil-delete-buffer
   "bp" 'evil-prev-buffer
   "bn" 'evil-next-buffer

   ;; deft operations
   "d" '(:ignore t :which-key "Deft")
   "dd" 'deft
   "df" 'deft-find-file

   ;; file and dir commands
   "f"  '(:ignore t :which-key "File commands")
   "ff" 'counsel-find-file
   "fa" 'find-file-at-point
   "fp" 'counsel-projectile
   "fs" 'save-buffer
   "fr" 'counsel-recentf

   ;; git operations
   "g" '(:ignore t :which-key "Git commands")
   "gs" 'magit-status
   "gd" 'magit-diff
   "gl" 'magit-log

   ;; help and docs
   "h" '(:ignore t :which-key "Help and documentation")
   "hf" 'counsel-describe-function
   "hv" 'counsel-describe-variable
   "hw" 'woman
   "hi" 'counsel-info-lookup-symbol

   ;; org-mode
   "o" '(:ignore t :which-key "Org-mode")
   "oa" 'org-agenda
   "oc" 'org-capture
   "oe" 'org-edit-special
   "ol" 'org-store-link
   "oL" 'org-insert-link
   "oo" 'counsel-outline
   "op" 'owp/do-publication
   "ot" 'counsel-org-tag

   ;; window operations
   "w" '(:ignore t :which-key "Windows")
   "ww" 'ace-window
   "wo" 'delete-other-windows
   "wv" 'evil-window-vsplit
   "ws" 'evil-window-split
   "wj" 'evil-window-down
   "wk" 'evil-window-up
   "wl" 'evil-window-right
   "wh" 'evil-window-left)
  (general-define-key "C-s" 'swiper)
  (general-define-key :keymaps 'org-mode-map :states '(insert normal emacs) "TAB" 'org-cycle))
(use-package which-key :ensure t
  :config
  (which-key-mode 1)
  :diminish which-key-mode)

(use-package company :ensure t
  :config
  (add-hook 'after-init-hook 'global-company-mode)
  (setq company-backend-list '(company-robe
                             company-web
                             company-jedi))
  :diminish company-mode)

(use-package yasnippet :ensure t
  :config
  (yas-global-mode t))

(if (eq window-system 'x)
