emacs/.emacs.d/Haoyang.el
  (progn ;; set English font
        (set-face-attribute 'default nil :font "Anonymous Pro-12")
        ;; Chinese font
        (dolist (charset '(kana han cjk-misc bopomofo))
          (set-fontset-font (frame-parameter nil 'font)
          charset (font-spec :family "Source Han Sans CN"
          :size 18)))
          (setq face-font-rescale-alist '(("Source Han Sans CN" . 1.0)))))

(use-package darktooth-theme :ensure t
  :config (load-theme 'darktooth t nil))

(use-package telephone-line :ensure t
  :config
  (setq telephone-line-lhs
        '((evil   . (telephone-line-evil-tag-segment))
          (accent . (telephone-line-vc-segment
                     telephone-line-erc-modified-channels-segment
                     telephone-line-process-segment))
          (nil    . (telephone-line-minor-mode-segment
                     telephone-line-buffer-segment))))
  (setq telephone-line-rhs
        '((nil    . (telephone-line-misc-info-segment))
          (accent . (telephone-line-major-mode-segment))
          (evil   . (telephone-line-airline-position-segment))))
  (telephone-line-mode 1))

(use-package org :ensure org-plus-contrib
  :config
  (progn
    (setq org-hide-emphasis-markers t) ; hide markers around bold/emphasis/delete etc, original value is nil.
    (setq org-ellipsis " ↲") ; more dense ellipsis, original value is '...'
    (setq org-agenda-files (list "~/org/organizer.org"))
    (setq org-todo-keywords
          '((sequence "TO-READ(r@)" "TO-WRITE(w@)" "TO-DO(t@)" "TO-LEARN(l@)" "WAITING(w@/!)" "|" "DONE(d@/!)" "CANCELLED(c@)")))
    (setq org-use-fast-todo-selection t)
    (setq org-use-fast-tag-selection t)
    (setq org-agenda-ndays 7)
    (setq org-agenda-show-all-dates t)
    (setq org-agenda-skip-scheduled-if-done t)
    (setq org-agenda-start-on-weekday nil)
    (setq org-reverse-note-order t) ; notes attached to item sorted in date desc order
    (setq org-deadline-warning-days 14) ; depend on your pacing, default is 3
    (setq org-default-notes-file "~/org/organizer.org")
    (setq org-capture-templates
          '(("t" "Task" entry (file+headline org-default-notes-file "Inbox")
             "* TO-DO %^{Title}\n")
            ("b" "Bookmark" entry (file+headline org-default-notes-file "Bookmarks")
             "* TO-READ %^{Title} %^g\n %^{URI} %?\n")
            ("n" "Work Notes" entry (clock)
             "* %^{Title}\n %U \n %^C \n\n %?")
            ("r" "Read Notes" entry (file+headline org-default-notes-file "Notes")
             "* %^{Title} %^g\n %^{URI|%x|%c} \n %?")
            ("q" "Quotes" entry (file+headline "~/org/wiki/quotes.org" "Quotes")
             "* %^{Text|%x|%c} %^g\n --%^{Source}")
            ("s" "Snippet" entry (file+headline org-default-notes-file "Snippets")
             "* %^{Title} %^g\n %U \n #+BEGIN_SRC \n %^C \n #+END_SRC \n %?")))
    (setq org-refile-targets '((nil . (:maxlevel . 6)))) ; default is to maxlevel 2
    (setq org-babel-load-languages
          '((sh . t)
            (emacs-lisp . t)
            (ruby . t)
            (R . t)
            (dot . t)
            (python . t)
            (haskell . t))) ; these are the langs I work with
    (org-babel-do-load-languages 'l t) ; required for the above to work
      (defadvice org-html-paragraph (before fsh-org-html-paragraph-advice
                                          (paragraph contents info) activate)
      "Join consecutive Chinese lines into a single long line without 
unwanted space when exporting org-mode to html."
      (let ((fixed-contents)
            (orig-contents (ad-get-arg 1))
            (reg-han "[[:multibyte:]]"))
        (setq fixed-contents (replace-regexp-in-string
                              (concat "\$latex " reg-han
                                      "\$ *\n *\$latex " reg-han "\$")
                              "\\1\\2" orig-contents))
        (ad-set-arg 1 fixed-contents)))))

(use-package org-bullets :ensure t
  :config
  (add-hook 'org-mode-hook (lambda () (org-bullets-mode 1)))
  )

(use-package org-ref :ensure t
  :config
  (setq reftex-default-bibliography '("~/org/bibliography/references.bib"))
  (setq org-ref-bibliography-notes "~/org/bibliography/notes.org"
        org-ref-default-bibliography '("~/org/bibliography/references.bib")
        org-ref-pdf-directory "~/org/bibliography/bibtex-pdfs/")
  )

(require 'ox-rss)

(use-package org-webpage :ensure t
  :config
  (owp/add-project-config
   '("expoundite.net"
     :repository-directory "~/org/websrc"
     :remote (rclone "local" "/tmp/website")
     :site-domain "https://expoundite.net"
     :site-main-title "chmod +w Web"
     :site-sub-title "Essays"
     :ignore ("upload.org")
     :theme (worg)
     :default-category "essay"
     :source-browse-url ("GitHub" "https://github.com/celadevra/expoundite.net")
     :web-server-port 9999)))

(use-package markdown-mode :ensure t
  :commands (markdown-mode gfm-mode)
  :mode (("\\.mdwn\\'" . markdown-mode)
         ("\\.md\\'" . markdown-mode)
         ("README\\.md\\'" . gfm-mode)))

(use-package haskell-mode :ensure t)

(use-package intero :ensure t
  :config
  (add-hook 'haskell-mode-hook 'intero-mode))
