emacs/.emacs.d/Haoyang.org
** Python
   #+BEGIN_SRC emacs-lisp
     (use-package python :ensure t
       :config
       (setq-default python-shell-interpreter "ipython")
       (setq-default python-shell-buffer-name "IPython")
       (setq python-shell-interpreter-args "--simple-prompt --colors=linux")
       (setq python-shell-prompt-input-regexp "In \\[0-9]+\\]: ")
       (setq python-shell-prompt-output-regexp "Out\\[0-9]+\\]: ")
       (setq python-shell-completion-setup-code
          "from IPython.core.completerlib import module_completion"
          python-shell-completion-module-string-code
          "';'.join(module_completion('''%s'''))\n"
          python-shell-completion-string-code
          "';'.join(get_ipython().Completer.all_completions('''%s'''))\n"))

     (use-package pyvenv :ensure t
       :config
       (add-hook 'pyvenv-post-activate-hooks 'pyvenv-restart-python))

     (use-package company-jedi :ensure t)
   #+END_SRC
** Web and JavaScript
   Web development is complex and requires no less than a full-blown IDE.
   Luckily, Emacs has some nice extensions for writing HTML, (S)CSS, templates,
   and JS codes.

   #+BEGIN_SRC emacs-lisp
     (use-package web-mode :ensure t
       :config
       (add-to-list 'auto-mode-alist '("\\.mustache\\'" . web-mode))
       (add-to-list 'auto-mode-alist '("\\.html?\\'" . web-mode))
       (add-to-list 'auto-mode-alist '("\\.css\\'" . web-mode))
       (setq web-mode-enable-current-element-highlight t)
       (defun my-web-mode-hook ()
         "hooks for webmode"
         (setq web-mode-markup-indent-offset 2)
         (setq web-mode-css-indent-offset 2)
         (setq web-mode-code-indent-offset 2))
       (add-hook 'web-mode-hook 'my-web-mode-hook))
   #+END_SRC

   #+RESULTS:
   : t
   
   #+BEGIN_SRC emacs-lisp
     (use-package js2-mode :ensure t
       :config
       (add-to-list 'auto-mode-alist '("\\.js\\'" . js2-mode))
       (add-to-list 'auto-mode-alist '("\\.json\\'" . js2-mode))
       (setq js2-strict-missing-semi-warning nil)
       (setq js2-missing-semi-one-line-override t))
   #+END_SRC

   #+RESULTS:
   : t
   
   #+BEGIN_SRC emacs-lisp
     (use-package less-css-mode :ensure t)
   #+END_SRC

   #+RESULTS:

* Applications
** Deft
   Deft is a note-taking tool allowing one to use Emacs like Notational Velocity
   and Simplenote. I am using it to quickly access the backend of a local Ikiwiki
   installation.
  
   #+BEGIN_SRC emacs-lisp
     (use-package deft :ensure t
       :config
       (setq deft-extensions '("md" "txt"))
       (setq deft-default-extension "md")
       (setq deft-directory "~/Notes")
       (setq deft-recursive t)
       (setq deft-use-filename-as-title t)
       (setq deft-use-filter-string-for-filename t))
   #+END_SRC
