emacs/.emacs.d/Haoyang.el

(use-package python :ensure t
  :config
  (setq-default python-shell-interpreter "ipython")
  (setq-default python-shell-buffer-name "IPython")
  (setq python-shell-interpreter-args "--simple-prompt --colors=linux")
  (setq python-shell-prompt-input-regexp "In \\[0-9]+\\]: ")
  (setq python-shell-prompt-output-regexp "Out\\[0-9]+\\]: ")
  (setq python-shell-completion-setup-code
     "from IPython.core.completerlib import module_completion"
     python-shell-completion-module-string-code
     "';'.join(module_completion('''%s'''))\n"
     python-shell-completion-string-code
     "';'.join(get_ipython().Completer.all_completions('''%s'''))\n"))

(use-package pyvenv :ensure t
  :config
  (add-hook 'pyvenv-post-activate-hooks 'pyvenv-restart-python))

(use-package company-jedi :ensure t)

(use-package web-mode :ensure t
  :config
  (add-to-list 'auto-mode-alist '("\\.mustache\\'" . web-mode))
  (add-to-list 'auto-mode-alist '("\\.html?\\'" . web-mode))
  (add-to-list 'auto-mode-alist '("\\.css\\'" . web-mode))
  (setq web-mode-enable-current-element-highlight t)
  (defun my-web-mode-hook ()
    "hooks for webmode"
    (setq web-mode-markup-indent-offset 2)
    (setq web-mode-css-indent-offset 2)
    (setq web-mode-code-indent-offset 2))
  (add-hook 'web-mode-hook 'my-web-mode-hook))

(use-package js2-mode :ensure t
  :config
  (add-to-list 'auto-mode-alist '("\\.js\\'" . js2-mode))
  (add-to-list 'auto-mode-alist '("\\.json\\'" . js2-mode))
  (setq js2-strict-missing-semi-warning nil)
  (setq js2-missing-semi-one-line-override t))

(use-package less-css-mode :ensure t)

(use-package deft :ensure t
  :config
  (setq deft-extensions '("md" "txt"))
  (setq deft-default-extension "md")
  (setq deft-directory "~/Notes")
  (setq deft-recursive t)
  (setq deft-use-filename-as-title t)
  (setq deft-use-filter-string-for-filename t))
